<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"c99936ecda65694a2601ce9edbde0e1703e68d96428597f7b334b0e4cde7a645","plan_job_ref":"Job Create terraform plan #25 at https://github.com/presentium/infrastructure/actions/runs/10286754528","plan_out_hash":"7d7763c8ffaa6fcd91015c3e3a2b5ff1978c352ae079fea7c37875ff8d413702","plan_hash":"89c9852bb9a0a3b517f5c489f227c8d5b98f1f759d6cb3f7daebaad1eb60e52a","plan_text_format":"diff","version":"1.44.0","closed":true} -->
Terraform plan in __infrastructure__
<details>
<summary>Plan: 29 to add, 9 to change, 1 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.argocd.null_resource.argocd_apply_once is tainted, so must be replaced
-/+ resource "null_resource" "argocd_apply_once" {
!~      id       = "*******************" -> (known after apply)
#        (1 unchanged attribute hidden)
    }

  # module.eks.aws_iam_policy.rds_policy["api-prod"] will be created
+   resource "aws_iam_policy" "rds_policy" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       description      = "Provides permissions to connect to RDS"
+       id               = (known after apply)
+       name             = (known after apply)
+       name_prefix      = "presentium-rds-policy-api-prod-"
+       path             = "/"
+       policy           = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = "rds-db:connect"
+                       Effect   = "Allow"
+                       Resource = "arn:aws:rds-db:eu-west-1:123247571664:dbuser:db-presentium/presentium-prod"
+                       Sid      = "AllowRDSAccess"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id        = (known after apply)
+       tags_all         = {
+           "Terraform" = "true"
        }
    }

  # module.eks.aws_iam_policy.rds_policy["api-staging"] will be created
+   resource "aws_iam_policy" "rds_policy" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       description      = "Provides permissions to connect to RDS"
+       id               = (known after apply)
+       name             = (known after apply)
+       name_prefix      = "presentium-rds-policy-api-staging-"
+       path             = "/"
+       policy           = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = "rds-db:connect"
+                       Effect   = "Allow"
+                       Resource = "arn:aws:rds-db:eu-west-1:123247571664:dbuser:db-presentium/presentium-staging"
+                       Sid      = "AllowRDSAccess"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id        = (known after apply)
+       tags_all         = {
+           "Terraform" = "true"
        }
    }

  # module.eks.aws_iam_policy.rds_policy["authentik"] will be created
+   resource "aws_iam_policy" "rds_policy" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       description      = "Provides permissions to connect to RDS"
+       id               = (known after apply)
+       name             = (known after apply)
+       name_prefix      = "presentium-rds-policy-authentik-"
+       path             = "/"
+       policy           = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = "rds-db:connect"
+                       Effect   = "Allow"
+                       Resource = "arn:aws:rds-db:eu-west-1:123247571664:dbuser:db-presentium/authentik"
+                       Sid      = "AllowRDSAccess"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id        = (known after apply)
+       tags_all         = {
+           "Terraform" = "true"
        }
    }

  # module.eks.aws_iam_policy.sops_policy will be created
+   resource "aws_iam_policy" "sops_policy" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       description      = "Provides permissions to use KMS for SOPS"
+       id               = (known after apply)
+       name             = (known after apply)
+       name_prefix      = "presentium-sops-policy-"
+       path             = "/"
+       policy           = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "kms:ReEncrypt*",
+                           "kms:GenerateDataKey*",
+                           "kms:Encrypt",
+                           "kms:DescribeKey",
+                           "kms:Decrypt",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = "AllowKeyUsage"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id        = (known after apply)
+       tags_all         = {
+           "Terraform" = "true"
        }
    }

  # module.iam.aws_iam_role.eks_admin will be created
+   resource "aws_iam_role" "eks_admin" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS = [
+                               "awn:aws:iam::123247571664:user/Sacha",
+                               "awn:aws:iam::123247571664:user/Massimo",
+                               "awn:aws:iam::123247571664:user/Loic",
+                               "awn:aws:iam::123247571664:user/Lea",
+                               "awn:aws:iam::123247571664:user/Christophe",
                            ]
                        }
+                       Sid       = "AllowAssumeRole"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "PRES-EKS-ADMIN"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = {
+           "Terraform" = "true"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.eks.module.dbconnect_irsa["api-prod"].aws_iam_role.this[0] will be created
+   resource "aws_iam_role" "this" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRoleWithWebIdentity"
+                       Condition = {
+                           StringEquals = {
+                               "oidc.eks.eu-west-1.amazonaws.com/id/7D237BCA403531BC4EAC898802E8C3E6:aud" = "*****************"
+                               "oidc.eks.eu-west-1.amazonaws.com/id/7D237BCA403531BC4EAC898802E8C3E6:sub" = "****************************************************"
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = {
+                           Federated = "arn:aws:iam::123247571664:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/7D237BCA403531BC4EAC898802E8C3E6"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "PRES-DB-API-PROD-PRESENTIUM"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = {
+           "Terraform" = "true"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.eks.module.dbconnect_irsa["api-prod"].aws_iam_role_policy_attachment.this["rds"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "PRES-DB-API-PROD-PRESENTIUM"
    }

  # module.eks.module.dbconnect_irsa["api-staging"].aws_iam_role.this[0] will be created
+   resource "aws_iam_role" "this" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRoleWithWebIdentity"
+                       Condition = {
+                           StringEquals = {
+                               "oidc.eks.eu-west-1.amazonaws.com/id/7D237BCA403531BC4EAC898802E8C3E6:aud" = "*****************"
+                               "oidc.eks.eu-west-1.amazonaws.com/id/7D237BCA403531BC4EAC898802E8C3E6:sub" = "*******************************************************"
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = {
+                           Federated = "arn:aws:iam::123247571664:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/7D237BCA403531BC4EAC898802E8C3E6"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "PRES-DB-API-STAGING-PRESENTIUM"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = {
+           "Terraform" = "true"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.eks.module.dbconnect_irsa["api-staging"].aws_iam_role_policy_attachment.this["rds"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "PRES-DB-API-STAGING-PRESENTIUM"
    }

  # module.eks.module.dbconnect_irsa["authentik"].aws_iam_role.this[0] will be created
+   resource "aws_iam_role" "this" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRoleWithWebIdentity"
+                       Condition = {
+                           StringEquals = {
+                               "oidc.eks.eu-west-1.amazonaws.com/id/7D237BCA403531BC4EAC898802E8C3E6:aud" = "*****************"
+                               "oidc.eks.eu-west-1.amazonaws.com/id/7D237BCA403531BC4EAC898802E8C3E6:sub" = "*****************************************"
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = {
+                           Federated = "arn:aws:iam::123247571664:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/7D237BCA403531BC4EAC898802E8C3E6"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "PRES-DB-AUTHENTIK-PRESENTIUM"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = {
+           "Terraform" = "true"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.eks.module.dbconnect_irsa["authentik"].aws_iam_role_policy_attachment.this["rds"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "PRES-DB-AUTHENTIK-PRESENTIUM"
    }

  # module.eks.module.eks.aws_eks_access_entry.this["admins"] will be created
+   resource "aws_eks_access_entry" "this" {
+       access_entry_arn  = (known after apply)
+       cluster_name      = "presentium"
+       created_at        = (known after apply)
+       id                = (known after apply)
+       kubernetes_groups = (known after apply)
+       modified_at       = (known after apply)
+       principal_arn     = (known after apply)
+       tags              = {
+           "karpenter.sh/discovery" = "presentium"
        }
+       tags_all          = {
+           "Terraform"              = "true"
+           "karpenter.sh/discovery" = "presentium"
        }
+       type              = "STANDARD"
+       user_name         = (known after apply)
    }

  # module.eks.module.eks.aws_eks_access_policy_association.this["admins_example"] will be created
+   resource "aws_eks_access_policy_association" "this" {
+       associated_at = (known after apply)
+       cluster_name  = "presentium"
+       id            = (known after apply)
+       modified_at   = (known after apply)
+       policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSViewPolicy"
+       principal_arn = (known after apply)

+       access_scope {
+           type = "cluster"
        }
    }

  # module.eks.module.eks.aws_eks_addon.this["coredns"] will be updated in-place
!~  resource "aws_eks_addon" "this" {
        id                          = "presentium:coredns"
        tags                        = {
            "karpenter.sh/discovery" = "presentium"
        }
!~      tags_all                    = {
+           "Terraform"              = "true"
#            (1 unchanged element hidden)
        }
#        (11 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.eks.module.eks.aws_eks_addon.this["kube-proxy"] will be updated in-place
!~  resource "aws_eks_addon" "this" {
        id                          = "presentium:kube-proxy"
        tags                        = {
            "karpenter.sh/discovery" = "presentium"
        }
!~      tags_all                    = {
+           "Terraform"              = "true"
#            (1 unchanged element hidden)
        }
#        (11 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.eks.module.eks.aws_eks_addon.this["vpc-cni"] will be updated in-place
!~  resource "aws_eks_addon" "this" {
        id                          = "presentium:vpc-cni"
!~      service_account_role_arn    = "arn:aws:iam::123247571664:role/MORP-VPC-CNI-PRESENTIUM" -> (known after apply)
        tags                        = {
            "karpenter.sh/discovery" = "presentium"
        }
!~      tags_all                    = {
+           "Terraform"              = "true"
#            (1 unchanged element hidden)
        }
#        (10 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.eks.module.karpenter.data.aws_iam_policy_document.controller[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "controller" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "ec2:CreateFleet",
+               "ec2:RunInstances",
            ]
+           resources = [
+               "arn:aws:ec2:*:*:launch-template/*",
+               "arn:aws:ec2:*:*:security-group/*",
+               "arn:aws:ec2:*:*:spot-instances-request/*",
+               "arn:aws:ec2:*:*:subnet/*",
+               "arn:aws:ec2:*::image/*",
+               "arn:aws:ec2:*::snapshot/*",
            ]
+           sid       = "AllowScopedEC2InstanceActions"
        }
+       statement {
+           actions   = [
+               "ec2:CreateFleet",
+               "ec2:CreateLaunchTemplate",
+               "ec2:RunInstances",
            ]
+           resources = [
+               "arn:aws:ec2:*:*:fleet/*",
+               "arn:aws:ec2:*:*:instance/*",
+               "arn:aws:ec2:*:*:launch-template/*",
+               "arn:aws:ec2:*:*:network-interface/*",
+               "arn:aws:ec2:*:*:spot-instances-request/*",
+               "arn:aws:ec2:*:*:volume/*",
            ]
+           sid       = "AllowScopedEC2InstanceActionsWithTags"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "owned",
                ]
+               variable = "aws:RequestTag/kubernetes.io/cluster/presentium"
            }
+           condition {
+               test     = "StringLike"
+               values   = [
+                   "*",
                ]
+               variable = "aws:RequestTag/karpenter.sh/nodepool"
            }
        }
+       statement {
+           actions   = [
+               "ec2:CreateTags",
            ]
+           resources = [
+               "arn:aws:ec2:*:*:fleet/*",
+               "arn:aws:ec2:*:*:instance/*",
+               "arn:aws:ec2:*:*:launch-template/*",
+               "arn:aws:ec2:*:*:network-interface/*",
+               "arn:aws:ec2:*:*:spot-instances-request/*",
+               "arn:aws:ec2:*:*:volume/*",
            ]
+           sid       = "AllowScopedResourceCreationTagging"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "RunInstances",
+                   "CreateFleet",
+                   "CreateLaunchTemplate",
                ]
+               variable = "ec2:CreateAction"
            }
+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "owned",
                ]
+               variable = "aws:RequestTag/kubernetes.io/cluster/presentium"
            }
+           condition {
+               test     = "StringLike"
+               values   = [
+                   "*",
                ]
+               variable = "aws:RequestTag/karpenter.sh/nodepool"
            }
        }
+       statement {
+           actions   = [
+               "ec2:CreateTags",
            ]
+           resources = [
+               "arn:aws:ec2:*:*:instance/*",
            ]
+           sid       = "AllowScopedResourceTagging"

+           condition {
+               test     = "ForAllValues:StringEquals"
+               values   = [
+                   "karpenter.sh/nodeclaim",
+                   "Name",
                ]
+               variable = "aws:TagKeys"
            }
+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "owned",
                ]
+               variable = "aws:ResourceTag/kubernetes.io/cluster/presentium"
            }
+           condition {
+               test     = "StringLike"
+               values   = [
+                   "*",
                ]
+               variable = "aws:ResourceTag/karpenter.sh/nodepool"
            }
        }
+       statement {
+           actions   = [
+               "ec2:DeleteLaunchTemplate",
+               "ec2:TerminateInstances",
            ]
+           resources = [
+               "arn:aws:ec2:*:*:instance/*",
+               "arn:aws:ec2:*:*:launch-template/*",
            ]
+           sid       = "AllowScopedDeletion"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "owned",
                ]
+               variable = "aws:ResourceTag/kubernetes.io/cluster/presentium"
            }
+           condition {
+               test     = "StringLike"
+               values   = [
+                   "*",
                ]
+               variable = "aws:ResourceTag/karpenter.sh/nodepool"
            }
        }
+       statement {
+           actions   = [
+               "ec2:DescribeAvailabilityZones",
+               "ec2:DescribeImages",
+               "ec2:DescribeInstanceTypeOfferings",
+               "ec2:DescribeInstanceTypes",
+               "ec2:DescribeInstances",
+               "ec2:DescribeLaunchTemplates",
+               "ec2:DescribeSecurityGroups",
+               "ec2:DescribeSpotPriceHistory",
+               "ec2:DescribeSubnets",
            ]
+           resources = [
+               "*",
            ]
+           sid       = "AllowRegionalReadActions"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "eu-west-1",
                ]
+               variable = "aws:RequestedRegion"
            }
        }
+       statement {
+           actions   = [
+               "ssm:GetParameter",
            ]
+           resources = [
+               "arn:aws:ssm:eu-west-1::parameter/aws/service/*",
            ]
+           sid       = "AllowSSMReadActions"
        }
+       statement {
+           actions   = [
+               "pricing:GetProducts",
            ]
+           resources = [
+               "*",
            ]
+           sid       = "AllowPricingReadActions"
        }
+       statement {
+           actions   = [
+               "sqs:DeleteMessage",
+               "sqs:GetQueueAttributes",
+               "sqs:GetQueueUrl",
+               "sqs:ReceiveMessage",
            ]
+           resources = [
+               "arn:aws:sqs:eu-west-1:123247571664:karpenter-presentium",
            ]
+           sid       = "AllowInterruptionQueueActions"
        }
+       statement {
+           actions   = [
+               "iam:PassRole",
            ]
+           resources = [
+               (known after apply),
            ]
+           sid       = "AllowPassingInstanceRole"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "ec2.amazonaws.com",
                ]
+               variable = "iam:PassedToService"
            }
        }
+       statement {
+           actions   = [
+               "iam:CreateInstanceProfile",
            ]
+           resources = [
+               "*",
            ]
+           sid       = "AllowScopedInstanceProfileCreationActions"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "eu-west-1",
                ]
+               variable = "aws:RequestTag/topology.kubernetes.io/region"
            }
+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "owned",
                ]
+               variable = "aws:RequestTag/kubernetes.io/cluster/presentium"
            }
+           condition {
+               test     = "StringLike"
+               values   = [
+                   "*",
                ]
+               variable = "aws:RequestTag/karpenter.k8s.aws/ec2nodeclass"
            }
        }
+       statement {
+           actions   = [
+               "iam:TagInstanceProfile",
            ]
+           resources = [
+               "*",
            ]
+           sid       = "AllowScopedInstanceProfileTagActions"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "eu-west-1",
                ]
+               variable = "aws:ResourceTag/topology.kubernetes.io/region"
            }
+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "owned",
                ]
+               variable = "aws:RequestTag/kubernetes.io/cluster/presentium"
            }
+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "owned",
                ]
+               variable = "aws:ResourceTag/kubernetes.io/cluster/presentium"
            }
+           condition {
+               test     = "StringLike"
+               values   = [
+                   "*",
                ]
+               variable = "aws:RequestTag/karpenter.k8s.aws/ec2nodeclass"
            }
+           condition {
+               test     = "StringLike"
+               values   = [
+                   "*",
                ]
+               variable = "aws:ResourceTag/karpenter.k8s.aws/ec2nodeclass"
            }
        }
+       statement {
+           actions   = [
+               "iam:AddRoleToInstanceProfile",
+               "iam:DeleteInstanceProfile",
+               "iam:RemoveRoleFromInstanceProfile",
            ]
+           resources = [
+               "*",
            ]
+           sid       = "AllowScopedInstanceProfileActions"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "eu-west-1",
                ]
+               variable = "aws:ResourceTag/topology.kubernetes.io/region"
            }
+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "owned",
                ]
+               variable = "aws:ResourceTag/kubernetes.io/cluster/presentium"
            }
+           condition {
+               test     = "StringLike"
+               values   = [
+                   "*",
                ]
+               variable = "aws:ResourceTag/karpenter.k8s.aws/ec2nodeclass"
            }
        }
+       statement {
+           actions   = [
+               "iam:GetInstanceProfile",
            ]
+           resources = [
+               "*",
            ]
+           sid       = "AllowInstanceProfileReadActions"
        }
+       statement {
+           actions   = [
+               "eks:DescribeCluster",
            ]
+           resources = [
+               "arn:aws:eks:eu-west-1:123247571664:cluster/presentium",
            ]
+           sid       = "AllowAPIServerEndpointDiscovery"
        }
    }

  # module.eks.module.karpenter.data.aws_iam_policy_document.queue[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "queue" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "sqs:SendMessage",
            ]
+           resources = [
+               "arn:aws:sqs:eu-west-1:123247571664:karpenter-presentium",
            ]
+           sid       = "SqsWrite"

+           principals {
+               identifiers = [
+                   "events.amazonaws.com",
+                   "sqs.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # module.eks.module.karpenter.aws_cloudwatch_event_rule.this["health_event"] will be updated in-place
!~  resource "aws_cloudwatch_event_rule" "this" {
        id                  = "KarpenterHealthEvent-20240725220633967200000013"
        name                = "KarpenterHealthEvent-20240725220633967200000013"
        tags                = {
            "ClusterName" = "presentium"
        }
!~      tags_all            = {
+           "Terraform"   = "true"
#            (1 unchanged element hidden)
        }
#        (10 unchanged attributes hidden)
    }

  # module.eks.module.karpenter.aws_cloudwatch_event_rule.this["instance_rebalance"] will be updated in-place
!~  resource "aws_cloudwatch_event_rule" "this" {
        id                  = "KarpenterInstanceRebalance-20240725220633962900000010"
        name                = "KarpenterInstanceRebalance-20240725220633962900000010"
        tags                = {
            "ClusterName" = "presentium"
        }
!~      tags_all            = {
+           "Terraform"   = "true"
#            (1 unchanged element hidden)
        }
#        (10 unchanged attributes hidden)
    }

  # module.eks.module.karpenter.aws_cloudwatch_event_rule.this["instance_state_change"] will be updated in-place
!~  resource "aws_cloudwatch_event_rule" "this" {
        id                  = "KarpenterInstanceStateChange-20240725220633963400000011"
        name                = "KarpenterInstanceStateChange-20240725220633963400000011"
        tags                = {
            "ClusterName" = "presentium"
        }
!~      tags_all            = {
+           "Terraform"   = "true"
#            (1 unchanged element hidden)
        }
#        (10 unchanged attributes hidden)
    }

  # module.eks.module.karpenter.aws_cloudwatch_event_rule.this["spot_interrupt"] will be updated in-place
!~  resource "aws_cloudwatch_event_rule" "this" {
        id                  = "KarpenterSpotInterrupt-20240725220633967000000012"
        name                = "KarpenterSpotInterrupt-20240725220633967000000012"
        tags                = {
            "ClusterName" = "presentium"
        }
!~      tags_all            = {
+           "Terraform"   = "true"
#            (1 unchanged element hidden)
        }
#        (10 unchanged attributes hidden)
    }

  # module.eks.module.karpenter.aws_eks_access_entry.node[0] will be created
+   resource "aws_eks_access_entry" "node" {
+       access_entry_arn  = (known after apply)
+       cluster_name      = "presentium"
+       created_at        = (known after apply)
+       id                = (known after apply)
+       kubernetes_groups = (known after apply)
+       modified_at       = (known after apply)
+       principal_arn     = (known after apply)
+       tags_all          = {
+           "Terraform" = "true"
        }
+       type              = "EC2_LINUX"
+       user_name         = (known after apply)
    }

  # module.eks.module.karpenter.aws_iam_instance_profile.this[0] will be created
+   resource "aws_iam_instance_profile" "this" {
+       arn         = (known after apply)
+       create_date = (known after apply)
+       id          = (known after apply)
+       name        = "PRES-KARPENTER-PRESENTIUM"
+       name_prefix = (known after apply)
+       path        = "/"
+       role        = "PRES-KARPENTER-PRESENTIUM"
+       tags_all    = {
+           "Terraform" = "true"
        }
+       unique_id   = (known after apply)
    }

  # module.eks.module.karpenter.aws_iam_policy.controller[0] will be created
+   resource "aws_iam_policy" "controller" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       description      = "Karpenter IAM role for service account"
+       id               = (known after apply)
+       name             = (known after apply)
+       name_prefix      = "PRES-KARPENTER-IRSA-PRESENTIUM-"
+       path             = "/"
+       policy           = (known after apply)
+       policy_id        = (known after apply)
+       tags_all         = {
+           "Terraform" = "true"
        }
    }

  # module.eks.module.karpenter.aws_iam_role.node[0] will be created
+   resource "aws_iam_role" "node" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ec2.amazonaws.com"
                        }
+                       Sid       = "EKSNodeAssumeRole"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "PRES-KARPENTER-PRESENTIUM"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = {
+           "Terraform" = "true"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.eks.module.karpenter.aws_iam_role_policy_attachment.controller[0] will be created
+   resource "aws_iam_role_policy_attachment" "controller" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "PRES-KARPENTER-IRSA-PRESENTIUM"
    }

  # module.eks.module.karpenter.aws_iam_role_policy_attachment.node["AmazonEC2ContainerRegistryReadOnly"] will be created
+   resource "aws_iam_role_policy_attachment" "node" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
+       role       = "PRES-KARPENTER-PRESENTIUM"
    }

  # module.eks.module.karpenter.aws_iam_role_policy_attachment.node["AmazonEKSWorkerNodePolicy"] will be created
+   resource "aws_iam_role_policy_attachment" "node" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
+       role       = "PRES-KARPENTER-PRESENTIUM"
    }

  # module.eks.module.karpenter.aws_sqs_queue.this[0] will be updated in-place
!~  resource "aws_sqs_queue" "this" {
        id                                = "https://sqs.eu-west-1.amazonaws.com/123247571664/karpenter-presentium"
        name                              = "karpenter-presentium"
        tags                              = {}
!~      tags_all                          = {
+           "Terraform" = "true"
        }
#        (18 unchanged attributes hidden)
    }

  # module.eks.module.karpenter.aws_sqs_queue_policy.this[0] will be updated in-place
!~  resource "aws_sqs_queue_policy" "this" {
        id        = "https://sqs.eu-west-1.amazonaws.com/123247571664/karpenter-presentium"
!~      policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "sqs:SendMessage"
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = [
-                               "sqs.amazonaws.com",
-                               "events.amazonaws.com",
                            ]
                        }
-                       Resource  = "arn:aws:sqs:eu-west-1:123247571664:karpenter-presentium"
-                       Sid       = "SqsWrite"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
#        (1 unchanged attribute hidden)
    }

  # module.eks.module.kms.aws_kms_alias.this["presentium/eks"] will be created
+   resource "aws_kms_alias" "this" {
+       arn            = (known after apply)
+       id             = (known after apply)
+       name           = "alias/presentium/eks"
+       name_prefix    = (known after apply)
+       target_key_arn = (known after apply)
+       target_key_id  = "************************************"
    }

  # module.eks.module.kms.aws_kms_alias.this["presentium/sops"] will be created
+   resource "aws_kms_alias" "this" {
+       arn            = (known after apply)
+       id             = (known after apply)
+       name           = "alias/presentium/sops"
+       name_prefix    = (known after apply)
+       target_key_arn = (known after apply)
+       target_key_id  = "************************************"
    }

  # module.eks.module.sops_kms_irsa.aws_iam_role.this[0] will be created
+   resource "aws_iam_role" "this" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRoleWithWebIdentity"
+                       Condition = {
+                           StringEquals = {
+                               "oidc.eks.eu-west-1.amazonaws.com/id/7D237BCA403531BC4EAC898802E8C3E6:aud" = "*****************"
+                               "oidc.eks.eu-west-1.amazonaws.com/id/7D237BCA403531BC4EAC898802E8C3E6:sub" = "***********************************************"
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = {
+                           Federated = "arn:aws:iam::123247571664:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/7D237BCA403531BC4EAC898802E8C3E6"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "PRES-SOPS-KMS-PRESENTIUM"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = {
+           "Terraform" = "true"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.eks.module.sops_kms_irsa.aws_iam_role_policy_attachment.this["sops"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "PRES-SOPS-KMS-PRESENTIUM"
    }

  # module.eks.module.vpc_cni_irsa.aws_iam_role.this[0] will be created
+   resource "aws_iam_role" "this" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRoleWithWebIdentity"
+                       Condition = {
+                           StringEquals = {
+                               "oidc.eks.eu-west-1.amazonaws.com/id/7D237BCA403531BC4EAC898802E8C3E6:aud" = "*****************"
+                               "oidc.eks.eu-west-1.amazonaws.com/id/7D237BCA403531BC4EAC898802E8C3E6:sub" = "******************************************"
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = {
+                           Federated = "arn:aws:iam::123247571664:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/7D237BCA403531BC4EAC898802E8C3E6"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "PRES-VPC-CNI-PRESENTIUM"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = {
+           "Terraform" = "true"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.eks.module.vpc_cni_irsa.aws_iam_role_policy_attachment.vpc_cni[0] will be created
+   resource "aws_iam_role_policy_attachment" "vpc_cni" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::123247571664:policy/AmazonEKS_CNI_Policy-20240725215451305100000002"
+       role       = "PRES-VPC-CNI-PRESENTIUM"
    }

  # module.rds.module.database.aws_rds_cluster.this[0] will be created
+   resource "aws_rds_cluster" "this" {
+       allocated_storage                     = (known after apply)
+       allow_major_version_upgrade           = false
+       apply_immediately                     = true
+       arn                                   = (known after apply)
+       availability_zones                    = (known after apply)
+       backtrack_window                      = 0
+       backup_retention_period               = (known after apply)
+       ca_certificate_identifier             = (known after apply)
+       ca_certificate_valid_till             = (known after apply)
+       cluster_identifier                    = "*************"
+       cluster_identifier_prefix             = (known after apply)
+       cluster_members                       = (known after apply)
+       cluster_resource_id                   = (known after apply)
+       copy_tags_to_snapshot                 = false
+       database_name                         = "db-presentium"
+       db_cluster_parameter_group_name       = (known after apply)
+       db_subnet_group_name                  = "presentium"
+       db_system_id                          = (known after apply)
+       delete_automated_backups              = true
+       deletion_protection                   = true
+       enable_global_write_forwarding        = false
+       enable_http_endpoint                  = false
+       enable_local_write_forwarding         = false
+       endpoint                              = (known after apply)
+       engine                                = "aurora-postgresql"
+       engine_lifecycle_support              = "open-source-rds-extended-support-disabled"
+       engine_mode                           = "provisioned"
+       engine_version                        = "16.3"
+       engine_version_actual                 = (known after apply)
+       hosted_zone_id                        = (known after apply)
+       iam_database_authentication_enabled   = true
+       iam_roles                             = (known after apply)
+       id                                    = (known after apply)
+       kms_key_id                            = (known after apply)
+       manage_master_user_password           = true
+       master_user_secret                    = (known after apply)
+       master_user_secret_kms_key_id         = (known after apply)
+       master_username                       = "admin"
+       network_type                          = (known after apply)
+       performance_insights_kms_key_id       = (known after apply)
+       performance_insights_retention_period = (known after apply)
+       port                                  = 5432
+       preferred_backup_window               = "02:00-03:00"
+       preferred_maintenance_window          = "sun:05:00-sun:06:00"
+       reader_endpoint                       = (known after apply)
+       skip_final_snapshot                   = true
+       storage_encrypted                     = true
+       storage_type                          = (known after apply)
+       tags_all                              = {
+           "Terraform" = "true"
        }
+       vpc_security_group_ids                = [
+           "sg-0b7a1f42a643798ff",
        ]

+       serverlessv2_scaling_configuration {
+           max_capacity = 1
+           min_capacity = 1
        }

+       timeouts {}
    }

  # module.rds.module.database.aws_rds_cluster_instance.this["one"] will be created
+   resource "aws_rds_cluster_instance" "this" {
+       apply_immediately                     = true
+       arn                                   = (known after apply)
+       auto_minor_version_upgrade            = true
+       availability_zone                     = (known after apply)
+       ca_cert_identifier                    = (known after apply)
+       cluster_identifier                    = (known after apply)
+       copy_tags_to_snapshot                 = false
+       db_parameter_group_name               = (known after apply)
+       db_subnet_group_name                  = "presentium"
+       dbi_resource_id                       = (known after apply)
+       endpoint                              = (known after apply)
+       engine                                = "aurora-postgresql"
+       engine_version                        = "16.3"
+       engine_version_actual                 = (known after apply)
+       id                                    = (known after apply)
+       identifier                            = "db-presentium-one"
+       identifier_prefix                     = (known after apply)
+       instance_class                        = "db.serverless"
+       kms_key_id                            = (known after apply)
+       monitoring_interval                   = 0
+       monitoring_role_arn                   = (known after apply)
+       network_type                          = (known after apply)
+       performance_insights_enabled          = (known after apply)
+       performance_insights_kms_key_id       = (known after apply)
+       performance_insights_retention_period = (known after apply)
+       port                                  = (known after apply)
+       preferred_backup_window               = (known after apply)
+       preferred_maintenance_window          = "sun:05:00-sun:06:00"
+       promotion_tier                        = 0
+       publicly_accessible                   = false
+       storage_encrypted                     = (known after apply)
+       tags_all                              = {
+           "Terraform" = "true"
        }
+       writer                                = (known after apply)

+       timeouts {}
    }

Plan: 29 to add, 9 to change, 1 to destroy.

Changes to Outputs:
+   eks_db_irsa_arns      = {
+       api-prod    = (known after apply)
+       api-staging = (known after apply)
+       authentik   = (known after apply)
    }
+   eks_sops_kms_role_arn = (known after apply)
```
</details>

:x: Error applying plan in [Apply terraform plan #6](https://github.com/presentium/infrastructure/actions/runs/10286779549)